In [84]:
import pandas as pd
import numpy as np

In [85]:
groceries = pd.Series(data=[30, 6, 'yes', 'no', 3.5], index=['apples', 'bananas', 'oranges', 'pears', 'grapes'])
groceries

apples      30
bananas      6
oranges    yes
pears       no
grapes     3.5
dtype: object

In [86]:
groceries.shape

(5,)

In [87]:
groceries.size

5

In [88]:
groceries.index

Index(['apples', 'bananas', 'oranges', 'pears', 'grapes'], dtype='object')

In [89]:
groceries.values

array([30, 6, 'yes', 'no', 3.5], dtype=object)

In [90]:
'bannanas' in groceries

False

In [91]:
'apples' in groceries

True

In [92]:
groceries['apples']

30

In [93]:
groceries[['oranges', 'pears', 'grapes']]

oranges    yes
pears       no
grapes     3.5
dtype: object

In [94]:
groceries.iloc[[0, 1, 4]]

apples      30
bananas      6
grapes     3.5
dtype: object

In [95]:
groceries.loc[['apples', 'bananas', 'grapes']]

apples      30
bananas      6
grapes     3.5
dtype: object

In [96]:
groceries

apples      30
bananas      6
oranges    yes
pears       no
grapes     3.5
dtype: object

In [97]:
groceries['apples'] = 20
groceries

apples      20
bananas      6
oranges    yes
pears       no
grapes     3.5
dtype: object

In [98]:
groceries

apples      20
bananas      6
oranges    yes
pears       no
grapes     3.5
dtype: object

In [99]:
groceries.drop('oranges')

apples      20
bananas      6
pears       no
grapes     3.5
dtype: object

In [100]:
groceries

apples      20
bananas      6
oranges    yes
pears       no
grapes     3.5
dtype: object

In [101]:
groceries.drop('oranges', inplace=True)

In [102]:
groceries

apples      20
bananas      6
pears       no
grapes     3.5
dtype: object

In [103]:
fruits = pd.Series(data=[30, 6, 3.5], index=['apples', 'bananas', 'grapes'])
fruits

apples     30.0
bananas     6.0
grapes      3.5
dtype: float64

In [104]:
fruits + 2

apples     32.0
bananas     8.0
grapes      5.5
dtype: float64

In [105]:
np.sqrt(fruits)

apples     5.477226
bananas    2.449490
grapes     1.870829
dtype: float64

In [106]:
np.power(fruits, 2)

apples     900.00
bananas     36.00
grapes      12.25
dtype: float64

In [107]:
fruits['bananas'] += 2
fruits

apples     30.0
bananas     8.0
grapes      3.5
dtype: float64

In [108]:
fruits.iloc[0] -= 3
fruits

apples     27.0
bananas     8.0
grapes      3.5
dtype: float64

In [109]:
planets = ['Mercury', 'Venus', 'Earth', 'Mars', 'Jupiter', 'Saturn', 'Uranus', 'Neptune']
distance_from_sun = [57.9, 108.2, 149.6, 227.9, 778.6, 1433.5, 2872.5, 4495.1]
planets_series = pd.Series(data=distance_from_sun, index=planets)
planets_series

Mercury      57.9
Venus       108.2
Earth       149.6
Mars        227.9
Jupiter     778.6
Saturn     1433.5
Uranus     2872.5
Neptune    4495.1
dtype: float64

In [110]:
time_light = planets_series / 18
time_light

Mercury      3.216667
Venus        6.011111
Earth        8.311111
Mars        12.661111
Jupiter     43.255556
Saturn      79.638889
Uranus     159.583333
Neptune    249.727778
dtype: float64

In [111]:
time_light.dtype

dtype('float64')

In [112]:
planets_series.dtype

dtype('float64')

In [113]:
planets_series['Earth']

np.float64(149.6)

In [114]:
close_planets = time_light[time_light <= 40]
close_planets

Mercury     3.216667
Venus       6.011111
Earth       8.311111
Mars       12.661111
dtype: float64

In [115]:
close_planets = time_light[time_light <= 40]
close_planets

Mercury     3.216667
Venus       6.011111
Earth       8.311111
Mars       12.661111
dtype: float64

DataFrames

In [116]:
items = {'Bob': pd.Series(data=[25, 30, 35], index=['Math', 'Science', 'English']), 'Alice': pd.Series(data=[28, 32, 30], index=['Math', 'Science', 'English'])}
type(items)

dict

In [117]:
students = pd.DataFrame(items)
students

         Bob  Alice
Math      25     28
Science   30     32
English   35     30

In [118]:
bob_score = pd.DataFrame(items, columns=['Bob'])
bob_score

         Bob
Math      25
Science   30
English   35

In [119]:
bob_science = students.loc['Science', 'Bob']
bob_science

np.int64(30)

In [120]:
math_scores = pd.DataFrame(items, index=['Math'])
math_scores

      Bob  Alice
Math   25     28

In [121]:
data = {'Integers': [1, 2, 3],
        'Floats': [1.0, 2.0, 3.0]}
df = pd.DataFrame(data, index=['A', 'B', 'C'])
df

   Integers  Floats
A         1     1.0
B         2     2.0
C         3     3.0

In [122]:
items = [{'bikes': 20, 'pants': 25, 'watches': 35}, {'bikes': 30, 'pants': 35, 'glasses': 40, 'watches': 45}]

stor_items = pd.DataFrame(items, index=['Store 1', 'Store 2'])
stor_items

         bikes  pants  watches  glasses
Store 1     20     25       35      NaN
Store 2     30     35       45     40.0

In [123]:
stor_items[['bikes']]

         bikes
Store 1     20
Store 2     30

In [124]:
stor_items.loc[['Store 1', 'Store 2'], ['bikes', 'pants']]

         bikes  pants
Store 1     20     25
Store 2     30     35

In [125]:
stor_items['shirts'] = [10, 15]
stor_items

         bikes  pants  watches  glasses  shirts
Store 1     20     25       35      NaN      10
Store 2     30     35       45     40.0      15

In [126]:
stor_items['suits'] = stor_items['shirts'] + stor_items['pants']
stor_items

         bikes  pants  watches  glasses  shirts  suits
Store 1     20     25       35      NaN      10     35
Store 2     30     35       45     40.0      15     50

In [127]:
new_itemes = [{'bikes': 25, 'pants': 30, 'watches': 40, 'shirts': 12, 'suits': 42}, {'bikes': 35, 'pants': 40, 'glasses': 45, 'watches': 50, 'shirts': 18, 'suits': 55}]
new_stor_items = pd.DataFrame(new_itemes, index=['Store 3', 'Store 4'])
new_stor_items

         bikes  pants  watches  shirts  suits  glasses
Store 3     25     30       40      12     42      NaN
Store 4     35     40       50      18     55     45.0

In [128]:
stor_items = pd.concat([stor_items, new_stor_items])
stor_items

         bikes  pants  watches  glasses  shirts  suits
Store 1     20     25       35      NaN      10     35
Store 2     30     35       45     40.0      15     50
Store 3     25     30       40      NaN      12     42
Store 4     35     40       50     45.0      18     55

In [129]:
stor_items['new_watches'] = stor_items['watches'][1:] * 1.25
stor_items

         bikes  pants  watches  glasses  shirts  suits  new_watches
Store 1     20     25       35      NaN      10     35          NaN
Store 2     30     35       45     40.0      15     50        56.25
Store 3     25     30       40      NaN      12     42        50.00
Store 4     35     40       50     45.0      18     55        62.50

In [130]:
stor_items.insert(2, 'discounted_bikes', stor_items['bikes'] * 0.9)
stor_items

,bikes,pants,discounted_bikes,watches,glasses,shirts,suits,new_watches
Store 1,20,25,18.0,35,NaN,10,35,NaN
Store 2,30,35,27.0,45,40.0,15,50,56.25
Store 3,25,30,22.5,40,NaN,12,42,50.00
Store 4,35,40,31.5,50,45.0,18,55,62.50

In [131]:
stor_items.pop('glasses')
stor_items

         bikes  pants  discounted_bikes  watches  shirts  suits  new_watches
Store 1     20     25              18.0       35      10     35          NaN
Store 2     30     35              27.0       45      15     50        56.25
Store 3     25     30              22.5       40      12     42        50.00
Store 4     35     40              31.5       50      18     55        62.50

In [132]:
stor_items = stor_items.drop('discounted_bikes', axis=1)
stor_items

         bikes  pants  watches  shirts  suits  new_watches
Store 1     20     25       35      10     35          NaN
Store 2     30     35       45      15     50        56.25
Store 3     25     30       40      12     42        50.00
Store 4     35     40       50      18     55        62.50

In [133]:
stor_items = stor_items.drop('Store 1', axis=0)
stor_items

         bikes  pants  watches  shirts  suits  new_watches
Store 2     30     35       45      15     50        56.25
Store 3     25     30       40      12     42        50.00
Store 4     35     40       50      18     55        62.50

In [134]:
stor_items = stor_items.rename(index={'Store 2': 'Outlet 1', 'Store 3': 'Outlet 2'})
stor_items

          bikes  pants  watches  shirts  suits  new_watches
Outlet 1     30     35       45      15     50        56.25
Outlet 2     25     30       40      12     42        50.00
Store 4      35     40       50      18     55        62.50

In [135]:
stor_items = stor_items.rename(columns={'bikes': 'bicycles', 'pants': 'trousers'})
stor_items

          bicycles  trousers  watches  shirts  suits  new_watches
Outlet 1        30        35       45      15     50        56.25
Outlet 2        25        30       40      12     42        50.00
Store 4         35        40       50      18     55        62.50

In [136]:
store_data = {
    'Bikes': [20, 25, 15, 30, 22],
    'Pants': [35, 40, 32, 38, 36],
    'Watches': [50, 45, 55, 60, 52],
    'Shirts': [18, 20, 17, 22, 19],
    'Suits': [10, 12, 9, 14, 11]
}

stores_df = pd.DataFrame(store_data, index=['North', 'South', 'East', 'West', 'Central'])
stores_df

         Bikes  Pants  Watches  Shirts  Suits
North       20     35       50      18     10
South       25     40       45      20     12
East        15     32       55      17      9
West        30     38       60      22     14
Central     22     36       52      19     11

In [137]:
import pandas as pd
import numpy as np

nyc_store_items = [
    {'location': 'Manhattan', 'shirts': 25, 'pants': 40, 'shoes': 30, 'hats': np.nan},
    {'location': 'Brooklyn', 'shirts': 18, 'pants': np.nan, 'shoes': 22, 'hats': 12},
    {'location': 'Queens', 'shirts': np.nan, 'pants': 35, 'shoes': 28, 'hats': 10},
    {'location': 'Bronx', 'shirts': 20, 'pants': 30, 'shoes': np.nan, 'hats': 8},
    {'location': 'Staten Island', 'shirts': 15, 'pants': 25, 'shoes': 20, 'hats': np.nan}
]
nyc_store_items_df = pd.DataFrame(nyc_store_items)
nyc_store_items_df = nyc_store_items_df.set_index('location')
nyc_store_items_df

               shirts  pants  shoes  hats
location
Manhattan        25.0   40.0   30.0   NaN
Brooklyn         18.0    NaN   22.0  12.0
Queens            NaN   35.0   28.0  10.0
Bronx            20.0   30.0    NaN   8.0
Staten Island    15.0   25.0   20.0   NaN

In [139]:
nyc_store_items_df.isnull().sum()

shirts    1
pants     1
shoes     1
hats      2
dtype: int64

In [140]:
nyc_store_items_df.count()

shirts    4
pants     4
shoes     4
hats      3
dtype: int64

In [143]:
nyc_store_items_df.ffill(axis=0)

               shirts  pants  shoes  hats
location
Manhattan        25.0   40.0   30.0   NaN
Brooklyn         18.0   40.0   22.0  12.0
Queens           18.0   35.0   28.0  10.0
Bronx            20.0   30.0   28.0   8.0
Staten Island    15.0   25.0   20.0   8.0